data = [
  {
    "Core Member (Name)": "Dani",
    "Course": "AFRICAM W111",
    "Instructor": "Small",
    "Semester": "Summer 17",
    "Rating (out of 10)": 8,
    "Comments": "Covered a breadth. Wasn't hard; don't fall behind. Barely did any readings lol and the midterm stressed me out."
  },
  {
    "Core Member (Name)": "Sheena",
    "Course": "ANTHRO R5B",
    "Instructor": "Alexandra McCleary",
    "Semester": "Spring 18",
    "Rating (out of 10)": 5,
    "Comments": "This class highly depends on what your GSI is like. Lots of readings and essays but no midterms/finals. I personally thought it was a pretty boring class."
  },
  {
    "Core Member (Name)": "Mikee",
    "Course": "ANTRHO 3AC",
    "Instructor": "Hirschkind",
    "Semester": "Fall 17",
    "Rating (out of 10)": 7,
    "Comments": "lowkey missed every lecture and didn't read a single reading, but not a bad class tho if you attend every discussion and take hardcore notes lol"
  },
  {
    "Core Member (Name)": "Sheena",
    "Course": "ART 8",
    "Instructor": "John McNamara",
    "Semester": "Fall 17",
    "Rating (out of 10)": 10,
    "Comments": "McNamara is an OK professor. Most of the time is spent with section, and I had a really great GSI. You can use any media you want (photography, drawing, sculpture, crafts, etc.). You don't have to know how to draw/have prior creative experience. This class pushes you to think creatively/out of the box. Fun class!"
  },
  {
    "Core Member (Name)": "AJ",
    "Course": "ASAMST 124",
    "Instructor": "Catherine Ceniza Choy",
    "Semester": "Fall 17",
    "Rating (out of 10)": 7,
    "Comments": "Filipino American History, so very relevant and interesting. Only thing was that attendance was mandatory, lots of essays and reading, and even though she's Filipino, she's not as chill as the Titas and Ate Karen, so don't call her tita (which does makes sense but yeah, not as chill as Filipino 1A lol). Also, you don't need ASAMST 20A to take this class, even though it's listed as a prereq, so don't make my mistake lol."
  },
  {
    "Core Member (Name)": "Kendal",
    "Course": "ASAMST 124",
    "Instructor": "",
    "Semester": "Fall 17",
    "Rating (out of 10)": "",
    "Comments": ""
  },
  {
    "Core Member (Name)": "Jo",
    "Course": "ASAMST 175",
    "Instructor": "Joi Barrios",
    "Semester": "Summer 2018",
    "Rating (out of 10)": 7,
    "Comments": "Easy A, good arts and lit breadth. Only offered in the summer"
  },
  {
    "Core Member (Name)": "Dani",
    "Course": "ASAMST 197",
    "Instructor": "Radley",
    "Semester": "Spring 17",
    "Rating (out of 10)": "∞",
    "Comments": "PASAE TILL I DIE. Actually tho, it's a super easy way to get to the right number of credits bc u probably spend much time w pasae anyway"
  },
  {
    "Core Member (Name)": "Kathryn",
    "Course": "ASAMST 197",
    "Instructor": "Radley Rigonan",
    "Semester": "Fall 16",
    "Rating (out of 10)": 10,
    "Comments": "Easiest 2 units I have ever taken"
  },
  {
    "Core Member (Name)": "AJ",
    "Course": "ASAMST 20A",
    "Instructor": "Catherine Ceniza Choy",
    "Semester": "Spring 17",
    "Rating (out of 10)": 6,
    "Comments": "Class is okay, tests are chill."
  },
  {
    "Core Member (Name)": "Sheena",
    "Course": "ASAMST 20AC",
    "Instructor": "Harvey Dong",
    "Semester": "Fall 16",
    "Rating (out of 10)": 6,
    "Comments": "Harvey is a really nice old man but he's a boring lecturer. Exams are easy multiple choice but other than that most of the grade is determined by GSI. Classwork includes readings, essays and a presentation."
  },
  {
    "Core Member (Name)": "Jo",
    "Course": "ASAMST W20AC",
    "Instructor": "Harvey Dong",
    "Semester": "Summer 2018",
    "Rating (out of 10)": 8,
    "Comments": "Mostly interesting. Very lenient with due dates. Good, easy, and interesting AC"
  },
  {
    "Core Member (Name)": "Kathryn",
    "Course": "ASTRON C10",
    "Instructor": "Alexei Fillipenko",
    "Semester": "Fall 16",
    "Rating (out of 10)": 8,
    "Comments": "This is a very popular class and it was pretty fun. The content was really interesting, but was more work than I anticipated. It's not the easiest class, but was enjoyable. He also hosts star parties on the top of Campbell (cute!), unfortunately, I never had time to go, but seemed like it could be fun."
  },
  {
    "Core Member (Name)": "Rigel",
    "Course": "Bio 1B",
    "Instructor": "Noah Whiteman, Lewis Feldman, George Roderick",
    "Semester": "Spring 18",
    "Rating (out of 10)": 8,
    "Comments": "All three lecturers are pretty engaging, though I only went to 2 lectures live lmaoooooo. Ez webcast and the midterms are relatively easy. There is an integrated lab section that's a lot of busy work (it's a four hour lab lmao rip). Covers plants, evolution, and ecology, which is mostly memorization like most other biology classes"
  },
  {
    "Core Member (Name)": "Justine Robin Puerto",
    "Course": "BioE 10",
    "Instructor": "Terry Johnshon",
    "Semester": "Fall 2016",
    "Rating (out of 10)": 10,
    "Comments": "Amazing professor. Homework and project heavy. No textbook so don't miss class."
  },
  {
    "Core Member (Name)": "Kiana Go",
    "Course": "BIOE 10",
    "Instructor": "Terry Johnson",
    "Semester": "Fall 17",
    "Rating (out of 10)": 10,
    "Comments": "Terry Johnson is honestly the best professor I had. The class is hard in terms of content, but just do all the homework and the final project, and you should have an A! The homework is impossible to do, so go to office hours and they'll tell you how to do them."
  },
  {
    "Core Member (Name)": "Dani",
    "Course": "BIOLOGY 1A",
    "Instructor": "Melis, Welch, Fischer",
    "Semester": "Fall 16",
    "Rating (out of 10)": 8,
    "Comments": "I like bio and I feel like I learned a lot of the material back in high school. Memorization tho ;("
  },
  {
    "Core Member (Name)": "Dani",
    "Course": "BIOLOGY 1AL",
    "Instructor": "Garriga",
    "Semester": "Fall 16",
    "Rating (out of 10)": 7,
    "Comments": "Idk I felt like some of the labs were a waste of time LOL. The class was only 2 units but the grading was like 90% exams."
  },
  {
    "Core Member (Name)": "Dani",
    "Course": "BIOLOGY 1B",
    "Instructor": "Shabel, Ackerly, Baldwin",
    "Semester": "Fall 17",
    "Rating (out of 10)": 7,
    "Comments": "Topics are boring but meh. Just memorize everything."
  },
  {
    "Core Member (Name)": "Dani",
    "Course": "Chem 103",
    "Instructor": "Chang",
    "Semester": "Fall 18",
    "Rating (out of 10)": 8,
    "Comments": "i like inorganic chem a LOT better than orgo; Chang is also a really good professor, and writes everything he says on the board pretty much verbatim."
  },
  {
    "Core Member (Name)": "Dani",
    "Course": "CHEM 120A",
    "Instructor": "Rabani, Whaley",
    "Semester": "Spring 17",
    "Rating (out of 10)": 7,
    "Comments": "Quantum is hard, especially when it's applied to chemistry lol. It's basically all math. I liked Rabani better than Whaley. The homework was worth 25% though, so that's like a large portion"
  },
  {
    "Core Member (Name)": "Dani",
    "Course": "Chem 120B",
    "Instructor": "Ginsberg",
    "Semester": "Fall 18",
    "Rating (out of 10)": 8,
    "Comments": "*easier than CHEM 120A* it's just a lot of math, which can get tedious, but the prof is really great at explaining the material"
  },
  {
    "Core Member (Name)": "Dani",
    "Course": "CHEM 125",
    "Instructor": "Stephen Leone",
    "Semester": "Spring 19",
    "Rating (out of 10)": 8,
    "Comments": "it's a pchem lab lol but you only have lab once every two weeks, and you get to choose 6 labs to do throughout the semester. Lab reports are kinda long and stressful because of data analysis but idk I like pchem so ¯\\_(ツ)_/¯"
  },
  {
    "Core Member (Name)": "Dani",
    "Course": "CHEM 12A",
    "Instructor": "Baranger",
    "Semester": "Fall 16",
    "Rating (out of 10)": 7,
    "Comments": "OChem is hard. Baranger is really organized though, and she was great at explaining things. Too much to memorize."
  },
  {
    "Core Member (Name)": "Dani",
    "Course": "CHEM 12B",
    "Instructor": "Sarpong, Robak (lab)",
    "Semester": "Spring 17",
    "Rating (out of 10)": 5,
    "Comments": "OChem got harder. There were like 4-5 reactions in every lecture that we had to memorize and it was RIP to the max. Exams were so hard. Lab portion was great, 5 hours is a long time but we barely ever used up the whole 5 hours."
  },
  {
    "Core Member (Name)": "Dani",
    "Course": "Chem 135",
    "Instructor": "Miller",
    "Semester": "Fall 18",
    "Rating (out of 10)": 8,
    "Comments": "Miller is a really good prof, and is really organized and clearly explains material. The material is also interesting because it gives real-life applicaitons of chem bio (and lol this is when a lot of people actually learn what chem bio including me yike)"
  },
  {
    "Core Member (Name)": "Jo",
    "Course": "Chem 1A",
    "Instructor": "Pines/Slack",
    "Semester": "Fall 2017",
    "Rating (out of 10)": 7,
    "Comments": "Work load wasn't bad at all! Tests were pretty fair too! I just really wan't interested at all"
  },
  {
    "Core Member (Name)": "Kathryn",
    "Course": "CHEM 1A",
    "Instructor": "Martin Head-Gordon, Teresa Head-Gordon",
    "Semester": "Fall 16",
    "Rating (out of 10)": 6,
    "Comments": "The class wasn't so bad considering how infamous the Head-Gordons are. It was tough, but if you understood what you learned from AP Chemistry, then it's not completely horrible. They both lecture using slides, but I prefer Martin Head-Gordon. He would sometimes use the board for calculations and diagrams."
  },
  {
    "Core Member (Name)": "Rigel",
    "Course": "Chem 1A",
    "Instructor": "Dean Toste",
    "Semester": "Fall 17",
    "Rating (out of 10)": 7,
    "Comments": "Ok lecturer, largely studied the material by myself. The midterms were pretty straightforward as far as I saw, but the final was lol (so difficult compared to all three midterms). The material was highkey just AP Chem stuff but at a faster pace"
  },
  {
    "Core Member (Name)": "Kathryn",
    "Course": "CHEM 1AL",
    "Instructor": "Michelle Douskey",
    "Semester": "Fall 16",
    "Rating (out of 10)": 7,
    "Comments": "Good class. You would use clickers for attendance and the same lecture was given multiple times during the week, so if you couldn't make a specific one you can go to a different one that's more convenient. She would annotate directly onto her slides during lecture."
  },
  {
    "Core Member (Name)": "Rigel",
    "Course": "Chem 1AL",
    "Instructor": "Michelle Douskey",
    "Semester": "Fall 17",
    "Rating (out of 10)": 6,
    "Comments": "Didn't particularly help much with my understanding with the regular lecture for Chem 1A. I thought it was mostly busy work and high school level experiments"
  },
  {
    "Core Member (Name)": "Dani",
    "Course": "CHEM 4A",
    "Instructor": "Cuk, Xu",
    "Semester": "Fall 15",
    "Rating (out of 10)": 7,
    "Comments": "Cuk was lowkey confusing bc she was all over the place (and she taught the intro to pchem portion so rip) but ya they expect AP Chem knowledge (a student asked a prof a question and they told them to \"look back in your AP Chem notes LOL #rekt)"
  },
  {
    "Core Member (Name)": "Dani",
    "Course": "CHEM 4B",
    "Instructor": "Williams, Cate",
    "Semester": "Spring 16",
    "Rating (out of 10)": 8,
    "Comments": "First half (learning about the machines) was super boring, but pretty easy bc just memorization. Chem bio portion was like very gentle ochem (arrow pushing, learning the amino acids). Williams's handwriting and diagrams were sometimes hard to read, Cate was super organized. omg special project was fun"
  },
  {
    "Core Member (Name)": "Dani",
    "Course": "CHEM 96",
    "Instructor": "Fischer",
    "Semester": "Fall 15",
    "Rating (out of 10)": 10,
    "Comments": "Was a great seminar bc researchers came in to talk about their research and it was based on attendance lmao but it was also just p/np"
  },
  {
    "Core Member (Name)": "JR",
    "Course": "Chem1A",
    "Instructor": "Teresa Head-Gordon",
    "Semester": "Fall 2016",
    "Rating (out of 10)": 1,
    "Comments": "I died. Cannot lecture."
  },
  {
    "Core Member (Name)": "Patty",
    "Course": "CLASSIC 28",
    "Instructor": "Duncan Macrae",
    "Semester": "Spring 2017",
    "Rating (out of 10)": 10,
    "Comments": "i give this a solid 10 because i loved it so much. i was in the same class as raffy. it's basically a discussion on myths of ancient Greece (and Rome maybe i can't remmber) and their purpose in ancient civilizations. fulfills the ethics and philosophy breadth and is hella fun if you love mythology. final project was to recreate a myth in a modern setting using whatever medium you wanted - writing, visual, video or dance or whatever. i got a 98/100 and it still makes me giddy. highkey my favorite class i've ever taken at berkeley. period."
  },
  {
    "Core Member (Name)": "Rafael",
    "Course": "CLASSIC 28",
    "Instructor": "",
    "Semester": "",
    "Rating (out of 10)": "",
    "Comments": ""
  },
  {
    "Core Member (Name)": "Rigel",
    "Course": "Classics 10A",
    "Instructor": "Leslie Kurke",
    "Semester": "Fall 17",
    "Rating (out of 10)": 9,
    "Comments": "I really liked this class cause I'm highkey interested in Ancient Greece and all that stuff (was thinking of minoring in Classics in one point lol but Data Sci). Prof Kurke is a great lecturer and adds great insight on the context between Greek literature and the concurrent history. Most of your grade depends on the two essays, so don't forget to know how to write lol"
  },
  {
    "Core Member (Name)": "Mikee",
    "Course": "CLASSICS 28",
    "Instructor": "Duncan MacRae",
    "Semester": "Spring 17",
    "Rating (out of 10)": 9,
    "Comments": "gr9 class; you're good if you know how to memorize terms cuz tbh i studied only like 2 nights before the every midterm and did fine; v interesting class if you're into greek mythology, british professor and v informative gsi's for extra points,"
  },
  {
    "Core Member (Name)": "Sheena",
    "Course": "COG SCI 1",
    "Instructor": "Paul Li",
    "Semester": "Spring 18",
    "Rating (out of 10)": 10,
    "Comments": "I love this class! Paul Li is awesome and keeps your attention the whole time with his aesthetic slides. This class covers the basics of Cog Sci really well and helped me throughout all of my future cog sci-related classes. 10/10 recommend. However, class gets filled quickly and it's very hard to get into so Phase I it."
  },
  {
    "Core Member (Name)": "Sheena",
    "Course": "COG SCI C127",
    "Instructor": "Jack Gallant",
    "Semester": "Fall 18",
    "Rating (out of 10)": 6,
    "Comments": "Jack is an interesting person and an OK lecturer. His slides are not that organized so it's good to take your own notes about what he says. No homeworks, but weekly readings and quizzes required."
  },
  {
    "Core Member (Name)": "Dani",
    "Course": "COM LIT R1A",
    "Instructor": "Drumsta, Brito",
    "Semester": "Fall 15",
    "Rating (out of 10)": 7,
    "Comments": "Instructors were super cool, but the topic of the class was boring lol (deserts as a theme rip)"
  },
  {
    "Core Member (Name)": "Dani",
    "Course": "COM LIT R1B",
    "Instructor": "Sela",
    "Semester": "Spring 16",
    "Rating (out of 10)": 7,
    "Comments": "I hate writing papers but the class was fun bc Sela was cool. The topic was also about love in literature so it was fun to read the books/stories"
  },
  {
    "Core Member (Name)": "Kathryn",
    "Course": "COMPSCI 88",
    "Instructor": "Gerald Friedland",
    "Semester": "Spring 18",
    "Rating (out of 10)": 4,
    "Comments": "Terrible lecturer. He would walk around the stage when he talked, but it wasn't even at like a leisurely pace, it was like he was fast walking, which was really distracting. Also the content he taught during lecture wasn't very helpful. I wish I took 61A instead of this, but I still got to learn how to code. The last project was kinda fun tho because it was data exploration and you got the opportunity to pick your own topic as long as you could find data for it."
  },
  {
    "Core Member (Name)": "AJ",
    "Course": "CS 10",
    "Instructor": "Dan Garcia",
    "Semester": "Fall 16",
    "Rating (out of 10)": 8,
    "Comments": "Dan Garcia is chill (one of the better and more interesting CS lecturers tbh), tests are chill. Only thing is that you have to go to labs and you have to work in partners. Otherwise, class is pretty easy (idk if I would say it helped me with CS 61A tho)."
  },
  {
    "Core Member (Name)": "Isabella",
    "Course": "CS 170",
    "Instructor": "Prasad & Luca",
    "Semester": "Spring 19",
    "Rating (out of 10)": "",
    "Comments": "61B but theoretical"
  },
  {
    "Core Member (Name)": "Rafael",
    "Course": "CS 170",
    "Instructor": "",
    "Semester": "",
    "Rating (out of 10)": "",
    "Comments": ""
  },
  {
    "Core Member (Name)": "Sheena",
    "Course": "CS 186",
    "Instructor": "Joseph Hellerstein",
    "Semester": "Fall 18",
    "Rating (out of 10)": 7,
    "Comments": "The class is set up to be mostly online even though it's not \"W\"186. The assignments are pretty spread apart so it's not as fast-paced as most of CS classes. You learn how to use SQL and how database systems work."
  },
  {
    "Core Member (Name)": "Rafael",
    "Course": "CS 188",
    "Instructor": "",
    "Semester": "Spring 18",
    "Rating (out of 10)": "",
    "Comments": ""
  },
  {
    "Core Member (Name)": "Seth",
    "Course": "CS 188",
    "Instructor": "Anwar Baroudi & Daniel Fried",
    "Semester": "Summer 18",
    "Rating (out of 10)": 9,
    "Comments": "Fun class. Projects and HWK were fun. Tests are hard though. Took it during the summer so the two that taught me were TAs on normal semesters."
  },
  {
    "Core Member (Name)": "Sheena",
    "Course": "CS 188",
    "Instructor": "Daniel Fried & Anwar Baroudi",
    "Semester": "Summer 18",
    "Rating (out of 10)": 8,
    "Comments": "Interesting class, especially if you want to learn how to make games (all our projects are Pacman-based). Projects are fun."
  },
  {
    "Core Member (Name)": "AJ",
    "Course": "CS 61A",
    "Instructor": "Hilfy (Paul Hilfinger)",
    "Semester": "Spring 2017",
    "Rating (out of 10)": 4,
    "Comments": "Again, if you're CS/Data Science/CogSci, you kinda need to take this class, so does this review matter? Heard Hilfy wasn't as good as the other lecturers but ehh, idk since I never went to lecture. Also doesn't really affect the projects since they never change."
  },
  {
    "Core Member (Name)": "Isabella",
    "Course": "CS 61A",
    "Instructor": "John DeNero",
    "Semester": "Fall 17",
    "Rating (out of 10)": 8,
    "Comments": "This class challenged me in ways that no other class at Berkeley has. 61A will definitely push you to your limits but it's a lot better if you have a community to go through all of it with you"
  },
  {
    "Core Member (Name)": "Jo",
    "Course": "CS 61A",
    "Instructor": "Denero",
    "Semester": "Spring 18",
    "Rating (out of 10)": 7,
    "Comments": "It's CS 61A if you're data, cs, cog sci, you have to take it. I personally like Denero as a lecturer so I'm glad I had him again. My gsi was also very kind and helpful. A good experience overall"
  },
  {
    "Core Member (Name)": "Kendal",
    "Course": "CS 61A",
    "Instructor": "John DeNero",
    "Semester": "Fall 16",
    "Rating (out of 10)": "",
    "Comments": ""
  },
  {
    "Core Member (Name)": "Mikee",
    "Course": "CS 61A",
    "Instructor": "John DeNero",
    "Semester": "Fall 18",
    "Rating (out of 10)": 7,
    "Comments": "refer to every cs major's shpeel about this class lol"
  },
  {
    "Core Member (Name)": "Rafael",
    "Course": "CS 61A",
    "Instructor": "",
    "Semester": "Fall 16",
    "Rating (out of 10)": "",
    "Comments": ""
  },
  {
    "Core Member (Name)": "Sheena",
    "Course": "CS 61A",
    "Instructor": "John Denero",
    "Semester": "Fall 16",
    "Rating (out of 10)": 9,
    "Comments": "I <3 Denero! He's a great lecturer. Go to his OH when his dog is there. Projects are hard and will take a loooong time, so I recommend having a solid partner (who is on the same level as you). I came in without prior CS experience and did pretty well. Just get all the help you can get (study groups, join CS Mentors, adjunct sections, OH, review sessions)."
  },
  {
    "Core Member (Name)": "AJ",
    "Course": "CS 61B",
    "Instructor": "Hilfy (Paul Hilfinger)",
    "Semester": "Fall 17",
    "Rating (out of 10)": 5,
    "Comments": "I liked this better than 61A tbh cuz this is where . This is where professor choice matters because Hilfy's 61B is more project-based, so more of the grade is based on projects. Hilfy also does Gitlet, which is one of the harder projects, or so I've heard."
  },
  {
    "Core Member (Name)": "Isabella",
    "Course": "CS 61B",
    "Instructor": "Josh Hug",
    "Semester": "Spring 18",
    "Rating (out of 10)": 9,
    "Comments": "Super great course. I will stress to take this class with Hug or anyone but Hilfinger. This course will teach you everything you need to know for interviews!"
  },
  {
    "Core Member (Name)": "Kendal",
    "Course": "CS 61B",
    "Instructor": "Josh Hug",
    "Semester": "Spring 17",
    "Rating (out of 10)": "",
    "Comments": ""
  },
  {
    "Core Member (Name)": "Rafael",
    "Course": "CS 61B",
    "Instructor": "",
    "Semester": "Spring 17",
    "Rating (out of 10)": "",
    "Comments": ""
  },
  {
    "Core Member (Name)": "Sheena",
    "Course": "CS 61B",
    "Instructor": "Josh Hug",
    "Semester": "Spring 16",
    "Rating (out of 10)": 8,
    "Comments": "Exams are impossible. Projects are fun. Would only recommend Hug if you're a good test taker. Otherwise, take other professors (Hilfinger). 61B is highly regarded as the class you need to get through job interviews, so study hard if you're planning to take it."
  },
  {
    "Core Member (Name)": "Isabella",
    "Course": "CS 61C",
    "Instructor": "Nick Weaver",
    "Semester": "Spring 19",
    "Rating (out of 10)": "",
    "Comments": "pull trigger"
  },
  {
    "Core Member (Name)": "Rafael",
    "Course": "CS 61C",
    "Instructor": "",
    "Semester": "Spring 18",
    "Rating (out of 10)": "",
    "Comments": ""
  },
  {
    "Core Member (Name)": "AJ",
    "Course": "CS 70",
    "Instructor": "Satish Rao",
    "Semester": "Spring 18",
    "Rating (out of 10)": 2,
    "Comments": "I hate this class, but if you're CS/CogSci, again, you kinda need it so... 🤷🤷🤷"
  },
  {
    "Core Member (Name)": "Isabella",
    "Course": "CS 70",
    "Instructor": "Alistair Sinclair/Yun Song",
    "Semester": "Fall 18",
    "Rating (out of 10)": 7,
    "Comments": "I liked the profs a lot. However, without a solid math background (coming in from only taking up to Math 1B) this was a pretty tricky class. If you're in a tricky position for meeting the GPA cap (like I was), I would highly recommend taking a class to improve your mathematical \"maturity\". I've heard classes that help include EE16A/B or Math 54 (haven't taken those yet tho). Or, there's the new CS 70 DeCal that I think could help a lot if you either take it concurrently or the semester before you take 70. Anyways, 70 sure is notorious for being a shock for those primarily used to coding classes. I generally found the material to be really interesting so as long as you enjoy fully learning the material, start HW when it's released, and go to HW parties/OH religiously I think you can do well. on that note lmk if you have questions about appealing to the CS major successfully!!"
  },
  {
    "Core Member (Name)": "Kendal",
    "Course": "CS 70",
    "Instructor": "",
    "Semester": "Summer 17",
    "Rating (out of 10)": 1,
    "Comments": "kms"
  },
  {
    "Core Member (Name)": "Rafael",
    "Course": "CS 70",
    "Instructor": "",
    "Semester": "Fall 17",
    "Rating (out of 10)": "",
    "Comments": ""
  },
  {
    "Core Member (Name)": "Sheena",
    "Course": "CS 70",
    "Instructor": "Satish Rao & Babak Ayazifar",
    "Semester": "Spring 18",
    "Rating (out of 10)": 0,
    "Comments": "Everyone hates this class but it's worth taking if you plan to be a Software Engineer/pursue a CS career. Would not recommend taking it when Satish is the professor."
  },
  {
    "Core Member (Name)": "Isabella",
    "Course": "CS C8",
    "Instructor": "Wagner",
    "Semester": "Fall 18",
    "Rating (out of 10)": 7,
    "Comments": "data 8 is gr8   hmm I didn't really go to all the lectures for this class which I kind of regret. This class tries really hard to make all the material super interesting and fun to learn so I highly recommend attending lecture. It's also pretty easy to fall behind by the middle of the sem - I think it's pretty doable for the first half with a 61A background but since I hadn't taken any stats-related courses before I was pretty lost for the second half. So don't fall behind!"
  },
  {
    "Core Member (Name)": "Jo",
    "Course": "CS C8",
    "Instructor": "Denero/Wagner",
    "Semester": "Fall 2017",
    "Rating (out of 10)": 8,
    "Comments": "Chill. Really good intro if you've never coded before! Denero is a good lecturer, Wagner is mediocre. Work load isn't too bad. Projects were cool"
  },
  {
    "Core Member (Name)": "Seth",
    "Course": "CS170",
    "Instructor": "Allesandro Chiesa & Satish Rao",
    "Semester": "Fall 18",
    "Rating (out of 10)": 2,
    "Comments": "Ewwwwwwwwwwwwwww. I didn't like it. But it changes the way you think about approaching a problem. If you're looking for SWE internships, this class actually helps you. Make sure you have a good hwk group cuz you're gonna need that."
  },
  {
    "Core Member (Name)": "Seth",
    "Course": "CS61A",
    "Instructor": "John Denero",
    "Semester": "Fall 2016",
    "Rating (out of 10)": 8,
    "Comments": "Fun class. Hard class if you're not focus on the subject like I was. Struggled a lot on midterms and tests. Do all the extra credits and stuff. Find a good partner too."
  },
  {
    "Core Member (Name)": "Seth",
    "Course": "CS61B",
    "Instructor": "Josh Hug",
    "Semester": "Spring 17",
    "Rating (out of 10)": 8,
    "Comments": "Liked it more than 61A. I think that's because I have some understanding on how to code lol compared to when I went in to 61A. Tests are hard yo., especially Midterm 2 and Final. Josh Hug makes tests hard. Projects and HWK were pretty fun."
  },
  {
    "Core Member (Name)": "Seth",
    "Course": "CS61C",
    "Instructor": "John Wawrzynek & Nick Weaver",
    "Semester": "Spring 18",
    "Rating (out of 10)": 7,
    "Comments": "Eh class. I hate C after this class. Nick Weaver bad professor. Last project he gave us a project on a language we never learned in this class or in any CS class before. The topics are interesting though. But the execution is eh lol"
  },
  {
    "Core Member (Name)": "Seth",
    "Course": "CS70",
    "Instructor": "Satish Rao & Kannan RAMCHANDRAN",
    "Semester": "Fall 17",
    "Rating (out of 10)": 1,
    "Comments": "Ewwwwwww. I guess you gotta take it if you're Cog Sci/CS or Applied Math with some focus on any CS."
  },
  {
    "Core Member (Name)": "Kendal",
    "Course": "DATA 100",
    "Instructor": "",
    "Semester": "Fall 17",
    "Rating (out of 10)": "",
    "Comments": ""
  },
  {
    "Core Member (Name)": "Seth",
    "Course": "Data 100",
    "Instructor": "Josh Hug & Fernando Perez",
    "Semester": "Fall 18",
    "Rating (out of 10)": 9,
    "Comments": "Fun class. Made it extra hard during my semester. Changed up all the hwk and projects. Kinda a mess of a class though but we still made it through lol. Also they made tests hard compared to previous semesters."
  },
  {
    "Core Member (Name)": "Mikee",
    "Course": "DATA 8",
    "Instructor": "David Wagner",
    "Semester": "Fall 18",
    "Rating (out of 10)": 8,
    "Comments": "so far not so bad, the hardest part was getting into the class, if you've taken stat 133, it's similar in terms of coding tabular data"
  },
  {
    "Core Member (Name)": "Seth",
    "Course": "Data 8",
    "Instructor": "Ani Adhikari",
    "Semester": "Spring 18",
    "Rating (out of 10)": 10,
    "Comments": "Best class in Berkeley. Well I kinda cheated cuz I've taken like 4 CS classes before taking this class but you basically learn up to for loops in D8. It teaches you mostly stat stuff. But light stat materials. I liked the class. Kinda choked on the final. But that final was pretty hard lol. Oh well"
  },
  {
    "Core Member (Name)": "Mikee",
    "Course": "ECON 1",
    "Instructor": "Enrico Moretti",
    "Semester": "Spring 18",
    "Rating (out of 10)": 8,
    "Comments": "i never took econ in hs so this is my first econ class and it wasn't bad at all, just make sure you really understand and apply the terms so you can beat the curve lol"
  },
  {
    "Core Member (Name)": "Patty",
    "Course": "EDUC 130",
    "Instructor": "Eddy Ham",
    "Semester": "Fall 2017",
    "Rating (out of 10)": 8,
    "Comments": "an 8 bc Eddy's fun. again, one of those classes i wouldn't recommend unless you're considering teaching. it's a CalTeach class and one of the ones that require a field placement - 2 hours a week at a high school. i think this one is about inquiry-based instruction and how to do it in classrooms. hella group activities."
  },
  {
    "Core Member (Name)": "Patty",
    "Course": "EDUC 131AC",
    "Instructor": "Dan Gloub",
    "Semester": "Spring 2018",
    "Rating (out of 10)": 9,
    "Comments": "another CalTeach course, another 2-hour field placement but this time in a middle school. Dan made the class fun and it's a lot on how equity and equality are not the same, and how you need equity in order to achieve equality. will open your eyes to how schools recreate stratification in the student population and how hard it is to change. also lots of group activities. such is CalTeach."
  },
  {
    "Core Member (Name)": "Rafael",
    "Course": "EE 120",
    "Instructor": "",
    "Semester": "Fall 17",
    "Rating (out of 10)": "",
    "Comments": ""
  },
  {
    "Core Member (Name)": "Rafael",
    "Course": "EE 123",
    "Instructor": "",
    "Semester": "Spring 18",
    "Rating (out of 10)": "",
    "Comments": ""
  },
  {
    "Core Member (Name)": "Rafael",
    "Course": "EE 128",
    "Instructor": "",
    "Semester": "Fall 18",
    "Rating (out of 10)": "",
    "Comments": ""
  },
  {
    "Core Member (Name)": "Rafael",
    "Course": "EE 16A",
    "Instructor": "",
    "Semester": "Fall 16",
    "Rating (out of 10)": "",
    "Comments": ""
  },
  {
    "Core Member (Name)": "Rafael",
    "Course": "EE 16B",
    "Instructor": "",
    "Semester": "Spring 17",
    "Rating (out of 10)": "",
    "Comments": ""
  },
  {
    "Core Member (Name)": "Rafael",
    "Course": "EE 225B",
    "Instructor": "",
    "Semester": "Spring 18",
    "Rating (out of 10)": "",
    "Comments": ""
  },
  {
    "Core Member (Name)": "Isabella",
    "Course": "ENGLISH 101",
    "Instructor": "Karen",
    "Semester": "Fall 18",
    "Rating (out of 10)": "",
    "Comments": "History of the English language (how english came to be and evolved over the years) with a sprinkling of Linguistics! This is probably the easiest history breadth (no reading!) to date. Would recommend"
  },
  {
    "Core Member (Name)": "Patty",
    "Course": "ENGLISH 43A",
    "Instructor": "Leila Mansouri",
    "Semester": "Spring 2017",
    "Rating (out of 10)": 9,
    "Comments": "i liked this class a lot despite the anxiety it gave me when it came to my writing. basically you read some prose, wrote about 300 words for homework each day for a prompt, and it all culminated in a 2000 word short story at the end. a LOT of peer reviewing. prepare to get dragged - but nicely. Leila doesn't teach here anymore, though, so i cant be sure how it is now."
  },
  {
    "Core Member (Name)": "Patty",
    "Course": "ENGLISH 98BC",
    "Instructor": "Shannon Chamberlain / Aileen Liu",
    "Semester": "Fall 2016/Spring 2017",
    "Rating (out of 10)": 10,
    "Comments": "fantastic if you wanna stay connected to something you're not majoring in - even though that's not what these are for oops. meet every other week just to talk about the subject - in the English one, we just read some poetry or short story and talked about it. you get free food, but its usually fruit and the sandwiches from GBC. sometimes they splurge. i loved it."
  },
  {
    "Core Member (Name)": "Seth",
    "Course": "English R1A",
    "Instructor": "Lise Gaston",
    "Semester": "Spring 17",
    "Rating (out of 10)": 8,
    "Comments": "Interesting class. Every R1A has different topic. This class' topic was letters. So we read letters and wrote letters. Lenient grder. Fun class"
  },
  {
    "Core Member (Name)": "Kathryn",
    "Course": "ENGLISH R1B",
    "Instructor": "Evan Wilson",
    "Semester": "Fall 17",
    "Rating (out of 10)": 8,
    "Comments": "He was really nice and understanding. The readings we read for class were also very interesting. But honestly every R&C class is different depending on who you have."
  },
  {
    "Core Member (Name)": "Seth",
    "Course": "English R1B",
    "Instructor": "Shokoofeh Rajabzadeh",
    "Semester": "Fall 17",
    "Rating (out of 10)": 9,
    "Comments": "Good professor. She doesn't believe in grades so she grades you based on effort lol. So basically the way she grades is if you do all the work she has in class you get a B as long as you put in effort. If you wanna raise your grades you do like extra work. 1 extra work = B+, 2 extra work = A-. all 4 extra work = A."
  },
  {
    "Core Member (Name)": "Audrey",
    "Course": "ENV DES 1",
    "Instructor": "Nicholas De Monchaux",
    "Semester": "Fall 17",
    "Rating (out of 10)": 10,
    "Comments": "This class was so fun! Nicholas gives really cool interesting lectures and the asssignments are engaging and push your creativity. Also my GSI was an angel (ty Mark)"
  },
  {
    "Core Member (Name)": "Patty",
    "Course": "EPS C82",
    "Instructor": "James Bishop",
    "Semester": "Fall 2017",
    "Rating (out of 10)": 7,
    "Comments": "i took this for a breadth too - biological, i think. i liked it because i like the ocean. had the same effect as Alex Filippenko's astronomy class did for me - but that's because i love space and the sea, so. lectures from powerpoints and has guests lecture too, but beware - that content wound up on the final and i could not for the life of me remember them. final was lowkey fun tho - i drew plankton from spongebob and got credit. a lot of memorization."
  },
  {
    "Core Member (Name)": "Kathryn",
    "Course": "ESPM C10",
    "Instructor": "Ronald Amundson",
    "Semester": "Spring 17",
    "Rating (out of 10)": 5,
    "Comments": "He has a pretty soft voice so I couldn't understand him at times and the assigned readings weren't clear. In the syllabus he would have us read specific chapters or sections, but we didn't have an actual textbook or reader or anything like that. He gave us a pdf of all readings for the semester but they were disorganized."
  },
  {
    "Core Member (Name)": "Jo",
    "Course": "FILIPN 1A/B",
    "Instructor": "Cynthia Aban (Tita Chat)",
    "Semester": "Fall 2017/Spring 2018",
    "Rating (out of 10)": 10,
    "Comments": "Saved my gpa fo sho. Also! got me more involved with the Pil community, especially PASAE. I didn't know any Tagalog at all and still did well (I believe most people get A's?). I wrote a love poem and recited it in front of a lot of people hmu if you want to hear it"
  },
  {
    "Core Member (Name)": "Rigel",
    "Course": "FILIPN 100B",
    "Instructor": "Ate Karen",
    "Semester": "Spring 18",
    "Rating (out of 10)": 10,
    "Comments": "I think everyone has already mentioned everything that needs to be said about this class. I had a great time and Ate Karen is hella fun"
  },
  {
    "Core Member (Name)": "Seth",
    "Course": "Filipino 100B",
    "Instructor": "Karen Llagas",
    "Semester": "Spring 17",
    "Rating (out of 10)": 10,
    "Comments": "Fun class. Easy class. Chill professor. I was listening to music while I was taking my final lol. If you need. a 5 unit A, take this class lol."
  },
  {
    "Core Member (Name)": "AJ",
    "Course": "FILIPN 100A",
    "Instructor": "Ate Karen (Karen Llagas)",
    "Semester": "Fall 17",
    "Rating (out of 10)": 10,
    "Comments": "Again, Titas and Ate are chill. I guess in terms of personal differences, she's not as out-there and crazy as the Titas, but class is still pretty chill."
  },
  {
    "Core Member (Name)": "Sheena",
    "Course": "FILIPN 100B",
    "Instructor": "Ate Karen",
    "Semester": "Spring 16",
    "Rating (out of 10)": 10,
    "Comments": "I'm fluent in Tagalog so I can't comment on the difficulty of this class, but Ate Karen is pretty lenient when grading as long as you try. There's a lot of class participation and it's fun."
  },
  {
    "Core Member (Name)": "AJ",
    "Course": "FILIPN 1A",
    "Instructor": "Tita Chat (Cynthia Aban)",
    "Semester": "Fall 16",
    "Rating (out of 10)": 10,
    "Comments": "Tita Chat is soooo chill. Gr8 class, gr9 professor, and just hella easy. Like take this class if you need units (it's 5 units!), a GPA boost, or wanna learn the language."
  },
  {
    "Core Member (Name)": "Dani",
    "Course": "FILIPN 1A/1B",
    "Instructor": "Tita Chat (Cynthia Aban)",
    "Semester": "Fall 17",
    "Rating (out of 10)": 10,
    "Comments": "Lol I know Filipino so it's not that hard but she's so cool and I have a lot of fun in that class"
  },
  {
    "Core Member (Name)": "Kathryn",
    "Course": "FILIPN 1B",
    "Instructor": "Karen Llagas (Ate Karen)",
    "Semester": "Spring 17",
    "Rating (out of 10)": 10,
    "Comments": "Ate Karen was great and we would start later than Berkeley time (Filipino time lol). The class was easy and you did a lot of group/partner stuff"
  },
  {
    "Core Member (Name)": "AJ",
    "Course": "FILIPN W1Y",
    "Instructor": "Tita Joi (Joi Barrios-Leblanc)",
    "Semester": "Spring 17",
    "Rating (out of 10)": 10,
    "Comments": "Again, all the titas are chill. Also, this class was the online version of Filipino 1B, so you can be in class anywhere, like I would do it in esh (but you still have to go at a specific time). I'm not saying cheat, but so many people cheated in this class, like you can tell because it would be in a chat room and sometimes people would forget to delete the name when the copied and pasted the answer above them, and liked Tita Joi is chill, so she kinda let it slide (TA was kinda ruthless about this tho so I guess depends on TA)."
  },
  {
    "Core Member (Name)": "Rafael",
    "Course": "Game Design Decal",
    "Instructor": "",
    "Semester": "Fall 18",
    "Rating (out of 10)": "",
    "Comments": ""
  },
  {
    "Core Member (Name)": "Sheena",
    "Course": "Game Design DeCal",
    "Instructor": "Jenny",
    "Semester": "Spring 19",
    "Rating (out of 10)": 8,
    "Comments": "For the first few weeks, class is basically labs and projects teaching you the basics of Unity. The rest are spent on working on a game with a group. You can choose to be an artist, programmer, musician or a hybrid of those. Can be kinda disorganized at times, but the people and instructors are super talented and nice. By the end of the decal, you would have learned how to use Unity, and 2 original projects you can put in your resume"
  },
  {
    "Core Member (Name)": "Seth",
    "Course": "Geog 183",
    "Instructor": "Alicia Cowart",
    "Semester": "Fall 18",
    "Rating (out of 10)": 9,
    "Comments": "If you're thinking of doing GIS take this class. Easy 5 unit A. You learn how to draw maps and how to style your maps. You have to be very detail oriented though cuz if you miss the slightest detail, the grader will mark you down."
  },
  {
    "Core Member (Name)": "Kendal",
    "Course": "GEOG 70AC",
    "Instructor": "",
    "Semester": "",
    "Rating (out of 10)": "",
    "Comments": ""
  },
  {
    "Core Member (Name)": "Seth",
    "Course": "Geog 80",
    "Instructor": "David O'Sullivan",
    "Semester": "Fall 17",
    "Rating (out of 10)": 9,
    "Comments": "Fun class. Take it if you're interested in doing GIS (Geospatial Information System). Easy class. Labs are fun. Final is take home so thats cool too."
  },
  {
    "Core Member (Name)": "Patty",
    "Course": "GWS 144",
    "Instructor": "Se' Terri Sullivan",
    "Semester": "Spring 2018",
    "Rating (out of 10)": 8,
    "Comments": "Prof. Sullivan knew what they were talking about because they'd highkey lived it. i took it for the international studies breadth. the class discussions every week stressed me out a lot, so be ready for a lot of public speaking. do a precis every week on the readings, but like a relaxed precis and only for credit. culminates in a final paper that i did the night before and still aced. good if you want to gain more knowledge on the queer struggle, and how it's different in the U.S. vs India. the structure was lecture, video, then discussion each week."
  },
  {
    "Core Member (Name)": "Isabella",
    "Course": "GWS 50AC",
    "Instructor": "Bonnie (Bonfire)",
    "Semester": "Fall 17",
    "Rating (out of 10)": 5,
    "Comments": "Easiest AC class ever. The lecturer didn't use slides, she just went off on tangents so I didn't need to go to lecture to do any of the assignments (which were just 3 short essays). Also the essays are based off of your life experiences soooo really easy."
  },
  {
    "Core Member (Name)": "Rafael",
    "Course": "Ham Radio Decal",
    "Instructor": "",
    "Semester": "",
    "Rating (out of 10)": "",
    "Comments": ""
  },
  {
    "Core Member (Name)": "Patty",
    "Course": "HISTART 88",
    "Instructor": "Lisa Trever",
    "Semester": "Fall 2016",
    "Rating (out of 10)": 8,
    "Comments": "took this class bc i thought i was gonna major in art at one point. i liked it a lot - just talkin about the art of Latin America. Trever had a dry sense of humor and was always lowkey salty, i think. she took up a position in Columbia now and my roommate (an art history major who was a research assistant under Trever) says she doesnt know much about the new person, so idk how itll be."
  },
  {
    "Core Member (Name)": "Kathryn",
    "Course": "HISTORY 100AC",
    "Instructor": "Stephanie Jones-Rogers",
    "Semester": "Fall 16",
    "Rating (out of 10)": 10,
    "Comments": "Easy class. The topic of my specific class was history of women in the US before the 1950's, so I really enjoyed the subject. Prof. Jones-Rogers was also a pretty good lecturer. There was reading that went along with the homework every week, but no midterms or papers. The final was also really easy because she pretty much gave you a study guide before so you know what to study (Also the final reminded me of how you would do the writing portion of an AP test lol)"
  },
  {
    "Core Member (Name)": "Seth",
    "Course": "History 100AC",
    "Instructor": "Bonnie Morris",
    "Semester": "Fall 18",
    "Rating (out of 10)": 9,
    "Comments": "Fun class. Different topic & different professor every semester. My semester's topic was History of Sports with Focus on Gender Women' Studies. Interesting class. Professor very chill."
  },
  {
    "Core Member (Name)": "AJ",
    "Course": "HISTORY 124B",
    "Instructor": "Natalie Mendoza",
    "Semester": "Spring 17",
    "Rating (out of 10)": 6,
    "Comments": "Took this for AC. Chill class/teacher, even though it's an upperdiv history, like she had to teach the class how to write essays and what primary and secondary sources were like wtf"
  },
  {
    "Core Member (Name)": "Dani",
    "Course": "IAS 150",
    "Instructor": "Bhandari",
    "Semester": "Summer 18",
    "Rating (out of 10)": 8,
    "Comments": "lol my prof did not GAF about anything, and the grading/tests were super easy; just a pain bc it was a summer class, so it was 4 days a week for 2 hours. Also covered a breadth class"
  },
  {
    "Core Member (Name)": "Kathryn",
    "Course": "IND ENG 135",
    "Instructor": "Ikhlaq Sighu, Alexander Fred-Ojala",
    "Semester": "Fall 18",
    "Rating (out of 10)": 7,
    "Comments": "It's an okay class. Everything that will be learned in the class is already uploaded to the class github so you don't really have to pay attention during lecture. There's weekly hw and short quizzes every so often, but this is mainly a project class, where you form groups and create a project during the semester and present it at the end. This could be a good class if you want a project, but you don't want to take time away from your school work bc this is your schoolwork. Also even though your project is a class project, each group has a completely different project idea, so it is very much more a personal/group project just with a bit more guidance than if you were to do it yourself lol"
  },
  {
    "Core Member (Name)": "Kathryn",
    "Course": "IND ENG 95",
    "Instructor": "Ikhlaq Sidhu, Victoria Howell",
    "Semester": "Fall 17",
    "Rating (out of 10)": 10,
    "Comments": "A 1-unit colloquium style class that was once a week for 1.5 hours. Every week a guest lecturer would come and talk about how they created their start-ups and businesses and would take questions from the audience. The class was just attendance and 1 group paper. The CEO of Yahoo! came and talk to us for one of the lectures!"
  },
  {
    "Core Member (Name)": "Seth",
    "Course": "ISF 61",
    "Instructor": "Earl Klee",
    "Semester": "Fall 2016",
    "Rating (out of 10)": 5,
    "Comments": "Too much reading for a class lol. Interesting class though. Should've PNP'd it. If you're good at writing and like reading books, take this class."
  },
  {
    "Core Member (Name)": "Rafael",
    "Course": "ITALIAN 130A",
    "Instructor": "",
    "Semester": "Fall 17",
    "Rating (out of 10)": "",
    "Comments": ""
  },
  {
    "Core Member (Name)": "Patty",
    "Course": "L&S C70U",
    "Instructor": "Alex Filippenko",
    "Semester": "Fall 2016",
    "Rating (out of 10)": 10,
    "Comments": "this class is the whole reason im aiming for astrophysics still. it was fun for me, even if the exams tripped me up a little bc of all the facts u had to know. the math is pretty basic in case thats a dealbreaker. i went to the bullsessions (lectures after hours about specific topics not covered in the class) bc i thought they were cool. star parties really made my semester! PSA: only ever offered in fall."
  },
  {
    "Core Member (Name)": "AJ",
    "Course": "LINGUIS 100",
    "Instructor": "Alice Shen",
    "Semester": "Summer 18",
    "Rating (out of 10)": 9,
    "Comments": "I love linguistics so much, like this class was hella fun. GSI was great too, but like GSIs only teach it in the summer I think (so idk about the professor if you take it in the Fall or Spring)."
  },
  {
    "Core Member (Name)": "Sheena",
    "Course": "LINGUIS 100",
    "Instructor": "Peter Jenks",
    "Semester": "Fall 18",
    "Rating (out of 10)": 8,
    "Comments": "Class can be hard/confusing at times but overall pretty interesting to learn linguistics. Jenks is a good lecturer although he goes through slides pretty fast."
  },
  {
    "Core Member (Name)": "Dani",
    "Course": "Linguis 5",
    "Instructor": "Hyman",
    "Semester": "Fall 18",
    "Rating (out of 10)": 7,
    "Comments": "it's interesting, but over-eager students tire me out tbh LOL; but the prof and GSIs are good at explaining material and making sure u understand it too"
  },
  {
    "Core Member (Name)": "Rigel",
    "Course": "Math 10A",
    "Instructor": "Zvezda Stankova",
    "Semester": "Fall 17",
    "Rating (out of 10)": 8,
    "Comments": "Very engaging professor that cares about her students; you need to go to lectures if you want to do well in the class since much of the test material is based off of stuff she talks about in class; your reinforcement of the material depends on the quality of your GSI lol; also do you hw if you want to succeed cause exam questions are also similar to HW.  As far as course material goes, it's similar to Calc BC just harder lol."
  },
  {
    "Core Member (Name)": "Rigel",
    "Course": "Math 10B",
    "Instructor": "Zvezda Stankova",
    "Semester": "Spring 18",
    "Rating (out of 10)": 8,
    "Comments": "Very similar to what I said above. As far as course material, very heavy on statistics and probability, Pretty difficult material overall for those unfamilar with the listed topics."
  },
  {
    "Core Member (Name)": "Kathryn",
    "Course": "MATH 110",
    "Instructor": "Edward Frenkel",
    "Semester": "Spring 18",
    "Rating (out of 10)": 4,
    "Comments": "I did not like Frenkel. His class is based solely on quizzes and tests, so he would give you homework assignments to prepare for the exams, but he did not grade or collect it. His teaching was all over the place. He would move across different boards a lot and it was just messy. However, I did do a lot better in the class than I thought lmao"
  },
  {
    "Core Member (Name)": "Patty",
    "Course": "MATH 110",
    "Instructor": "Edward Frenkel",
    "Semester": "Spring 2018",
    "Rating (out of 10)": 4,
    "Comments": "PSA: i failed this class. take my review with a grain of salt. dude says almost everything is important. also has an accent. also the dude with the weird math videos. once my friend brought it to my attention, i couldn't think of anything else. lectures tended to run over a little, if i remember correctly. goes through proofs a lot, which was useful if only i could remember them. i was in the same class as kathryn and seth."
  },
  {
    "Core Member (Name)": "Seth",
    "Course": "Math 110",
    "Instructor": "Edward Frenkel",
    "Semester": "Spring 18",
    "Rating (out of 10)": 5,
    "Comments": "One of the worst professors in Berkeley. Like he goes off tangent so much during lecture. He doesn't collect hwk. Quizzes, Midterm, and Final are your grade. His midterm is pretty hard. I think he was just trying to weed out people. Final is not commulative so that was good and also his final was surprisingly doable lol. This class taught me that the curve in the Math Department is really good lol."
  },
  {
    "Core Member (Name)": "Patty",
    "Course": "MATH 128A",
    "Instructor": "Jon Wilkening",
    "Semester": "Fall 2018",
    "Rating (out of 10)": 7,
    "Comments": "still happening, but so far he is a soft soft man trying his best. does the lectures on his tablet and projects it so we can follow along. will sometimes write whole ass proofs beforehand and therefore not give you time to copy it in lecture. posts the lectures online, though, and before the midterm posts one huge pdf of all the relevant lectures for you to scroll through. allows cheat sheets and a lot of help with coding."
  },
  {
    "Core Member (Name)": "Patty",
    "Course": "MATH 151",
    "Instructor": "Ole Hald",
    "Semester": "Fall 2018",
    "Rating (out of 10)": 8,
    "Comments": "still happening and is pretty straight-forward. about breaking down the math we know and proving what we take for granted. gives you copies of his handwritten notes that show exactly what he's going to cover. a lot of partner work on the blackboards. will call you out at some point to do a homework problem on the board, and half the time it'll be to show that you were wrong so the entire class can learn from it. a kind old man from Denmark who will sometimes randomly let out a shout of exclamation and has hella books on math."
  },
  {
    "Core Member (Name)": "Isabella",
    "Course": "Math 1A",
    "Instructor": "Vivek Shende",
    "Semester": "Fall 17",
    "Rating (out of 10)": 6,
    "Comments": "Definitely solid course if you're already taken calculus. Otherwise, still pretty chill"
  },
  {
    "Core Member (Name)": "Geraldine",
    "Course": "Math 1A",
    "Instructor": "Pierre Simone",
    "Semester": "Fall 17",
    "Rating (out of 10)": 8,
    "Comments": "Not teaching Math 1A anymore. Lectures are extremely organized and pacing is medium. Very sassy profesor, but fun. Overall, the class as fairly achievable. Take adjunct courses too (like study group but with units)! They make a big difference!"
  },
  {
    "Core Member (Name)": "Isabella",
    "Course": "Math 1B",
    "Instructor": "Dyatlov",
    "Semester": "Spring 18",
    "Rating (out of 10)": 6,
    "Comments": "I cri... but I highly recommend taking the adjunct (only if u have the time and are okay with dying a little). also daddy dyatlov is the best"
  },
  {
    "Core Member (Name)": "Jo",
    "Course": "Math 1b",
    "Instructor": "Mark Haiman",
    "Semester": "Spring 2018",
    "Rating (out of 10)": 5,
    "Comments": "I did not put as much effort as I should have in this class. I think Haiman is a good professor and lecturer. I really think my struggles are a result of my own shortcomings. Remember to work hard!"
  },
  {
    "Core Member (Name)": "Sheena",
    "Course": "MATH 1B",
    "Instructor": "Zvezdelina Stankova",
    "Semester": "Spring 16",
    "Rating (out of 10)": 4,
    "Comments": "If you can skip this class, do it. Exams are hard and HWs take a long time. Study groups highly recommended."
  },
  {
    "Core Member (Name)": "Dani",
    "Course": "MATH 53",
    "Instructor": "Gomez",
    "Semester": "Fall 15",
    "Rating (out of 10)": 8,
    "Comments": "I LOVED GOMEZ HE WAS AWESOME. Also I had a really good calc background, so that's why it wasn't too bad for me. Chapter 16 (the last chapter) rekt me and everyone in the class tho"
  },
  {
    "Core Member (Name)": "Kathryn",
    "Course": "MATH 53",
    "Instructor": "John Steel",
    "Semester": "Fall 16",
    "Rating (out of 10)": 5,
    "Comments": "The class itself wasn't so bad, but the professor was kinda inaudible and it was hard to see the board. When he made mistakes, he would erase with his fingers and then the eraser, leaving marks that would make what he was writing very difficult to read. He was an old man tho and would kinda make jokes which was kinda cute and funny, but his teaching was just not good. My GSI was pretty okay; sometimes he wouldn't really come with a plan for section (lmao same), but usually he would go over some concepts that we will cover in the next section. He also wore really cool shirts"
  },
  {
    "Core Member (Name)": "Mikee",
    "Course": "MATH 53",
    "Instructor": "Zworski",
    "Semester": "Spring 17",
    "Rating (out of 10)": 6,
    "Comments": "This class can be hard and confusing, go to adjunct early in the semester if you feel like you need help, depending on professor, exams can be hecka wack and hecka extra harder than they should be"
  },
  {
    "Core Member (Name)": "Patty",
    "Course": "MATH 53",
    "Instructor": "Marciej Zworski",
    "Semester": "Spring 2017",
    "Rating (out of 10)": 7,
    "Comments": "dude knows his stuff but his accent is sorta difficult to understand sometimes (especially for terms you don't now yet - at least for me it was) and DAMN his exams were hard. otherwise good. should probably sit in the front if u can't see well - it's chalk on a blackboard and he uses all of 'em."
  },
  {
    "Core Member (Name)": "Rafael",
    "Course": "MATH 53",
    "Instructor": "",
    "Semester": "Spring 17",
    "Rating (out of 10)": "",
    "Comments": ""
  },
  {
    "Core Member (Name)": "Seth",
    "Course": "Math 53",
    "Instructor": "Dennis Auroux",
    "Semester": "Fall 17",
    "Rating (out of 10)": 9,
    "Comments": "One of my favorite classes here at Cal cuz I like Calculus. Also the professor is very good. Clear lecturer. He writes on the board so you gotta be in the front. His lectures are online too cuz he taught in MIT and they still have that. If Kyeongsik Nam is teaching one of the discussions, take it with him. His quizzes are doable and a good GSI."
  },
  {
    "Core Member (Name)": "AJ",
    "Course": "MATH 54",
    "Instructor": "Ming Gu",
    "Semester": "Fall 16",
    "Rating (out of 10)": 3,
    "Comments": "I mean if you're CS, you need this class, so does this review even matter? Heard the professor was a bad lecturer (tbh idk since I never went to class), but his tests are easier relatively. Also had a policy where we could take both midterms or just take one but it would be graded harder. Otherwise, this was also the class that made me think maybe I'm not so good at math after all."
  },
  {
    "Core Member (Name)": "Dani",
    "Course": "MATH 54",
    "Instructor": "Wehrheim",
    "Semester": "Spring 16",
    "Rating (out of 10)": 3,
    "Comments": "Highkey worst class I took here lol. I didn't like her at all and my GSI was useless. On the first day of class she was like \"my goal is to confuse you. If you're not confused, I didn't do my job.\" Save urself and don't take 54 with her."
  },
  {
    "Core Member (Name)": "JR",
    "Course": "Math 54",
    "Instructor": "Lin Lin",
    "Semester": "Fall 2016",
    "Rating (out of 10)": 1,
    "Comments": "I hate Linear Algebra. Couldn't understand professor."
  },
  {
    "Core Member (Name)": "Kathryn",
    "Course": "MATH 54",
    "Instructor": "Michael Hutchings",
    "Semester": "Fall 17",
    "Rating (out of 10)": 7,
    "Comments": "Prof. Hutchings was alright. He taught using the projector so it was a lot easier to read his writing. He taught a section that wasn't in the official UC Berkeley textbook for this class and what other 54 professors usually don't teach but it was alright. I *kinda* like 54, it's hard but also kind useful and these concepts appear more than you think. My GSI was okay too; he like really encouraged group work"
  },
  {
    "Core Member (Name)": "Kendal",
    "Course": "MATH 54",
    "Instructor": "",
    "Semester": "Fall 17",
    "Rating (out of 10)": "",
    "Comments": ""
  },
  {
    "Core Member (Name)": "Patty",
    "Course": "MATH 54",
    "Instructor": "David Nadler",
    "Semester": "Fall 2017",
    "Rating (out of 10)": 8,
    "Comments": "i did not go to the last half of lectures nor the last half of sections. i still passed. did i learn anything? i can't be sure. but when i did go, he had energy and made linear algebra entertaining. i think it was just the way he spoke about it. also posts his lecture notes, which is highkey the only reason i passed."
  },
  {
    "Core Member (Name)": "Rafael",
    "Course": "MATH 54",
    "Instructor": "",
    "Semester": "Fall 16",
    "Rating (out of 10)": "",
    "Comments": ""
  },
  {
    "Core Member (Name)": "Seth",
    "Course": "Math 54",
    "Instructor": "Nikhil Srivastava",
    "Semester": "Fall 2016",
    "Rating (out of 10)": 6,
    "Comments": "Alright class. Nikhil is a good lecturer. Stuggled a lot in this class. Discussion GSI was bad. Didn't explain material properly. Tests are pretty difficult but doable."
  },
  {
    "Core Member (Name)": "Sheena",
    "Course": "MATH 54",
    "Instructor": "David Nadler",
    "Semester": "Fall 17",
    "Rating (out of 10)": 7,
    "Comments": "Nadler is a great lecturer and he explains concepts clearly. HWs and exams are hard though, so I would recommend having a study group or going to SLC for tutoring."
  },
  {
    "Core Member (Name)": "Kathryn",
    "Course": "MATH 55",
    "Instructor": "Olga Holtz",
    "Semester": "Fall 17",
    "Rating (out of 10)": 7,
    "Comments": "She was okay. She had worksheets for every lecture and you would have to complete it and turn it in the night of and sometimes the material on the worksheets weren't covered in lecture. Also for homework she would give you 5 problems and randomly grade 1 of them. Also her teaching style changes every year tho, so she isn't consistent. Like I heard that in a previous year she didn't do the worksheet thing, but would like make people email their GSI about something idk. She also held her own review sessions from time to time which was really nice of her. She is very passionate about math, just not the best at lecturing. Overall, she is definitely not a bad professor"
  },
  {
    "Core Member (Name)": "Mikee",
    "Course": "MATH 55",
    "Instructor": "Olga Holtz",
    "Semester": "Fall 17",
    "Rating (out of 10)": 7,
    "Comments": "professor was meh, math professors aren't the best tbh, if you need help, addison holds adjunct classes he's so helpful, tbh the class wasn't the worst math class i took, but you still gotta study hard"
  },
  {
    "Core Member (Name)": "Patty",
    "Course": "MATH 55",
    "Instructor": "Lauren Williams",
    "Semester": "Spring 2018",
    "Rating (out of 10)": 7,
    "Comments": "she's really good at explaining things, but has a soft voice that lowkey made me wanna take a nap a good chunk of the time. had many examples to illustrate probability and even conducted a demonstration of the Monty Hall problem with students from the lecture. was as good as Discrete Mathematics can get in my opinion."
  },
  {
    "Core Member (Name)": "Dani",
    "Course": "MCELLBI 110",
    "Instructor": "Eva Nogales; Jeremy Thorner; Qiang Zhou",
    "Semester": "Spring 19",
    "Rating (out of 10)": 7,
    "Comments": "idk there's a lot of memorization but it's a lot of stuff I've already learned in other mcb/chem classes, just more in depth"
  },
  {
    "Core Member (Name)": "Dani",
    "Course": "MCELLBI C112",
    "Instructor": "Grosser",
    "Semester": "Summer 18",
    "Rating (out of 10)": 9,
    "Comments": "Grosser was a gr9 prof and the material covered was really interesting!!! I had a lot of fun"
  },
  {
    "Core Member (Name)": "AJ",
    "Course": "MCELLBI C64",
    "Instructor": "Sarah Leinwand",
    "Semester": "Summer 18",
    "Rating (out of 10)": 6,
    "Comments": "Lots of memorization. Yeah idk, it was aight."
  },
  {
    "Core Member (Name)": "Sheena",
    "Course": "MCELLBI W61",
    "Instructor": "David Presti",
    "Semester": "Summer 18",
    "Rating (out of 10)": 9,
    "Comments": "Easy class. Quizzes and exams require memorization and understanding of readings."
  },
  {
    "Core Member (Name)": "Dani",
    "Course": "MCELLBI/CHEM C110L",
    "Instructor": "Isabelle LeBlanc; Eunyong Park",
    "Semester": "Spring 19",
    "Rating (out of 10)": 5,
    "Comments": "This lab meets twice a week for a 1 hr lab lecture followed by a 3 hr lab and it's honestly just so much time and busy work it's annoying lol. Also they grade really harshly?? I got like 2 points taken off on a worksheet for not explicitly showing a unit conversion in an intermediate step..."
  },
  {
    "Core Member (Name)": "Dani",
    "Course": "MCELLBI 100B",
    "Instructor": "Zoncu/Marletta/Savage",
    "Semester": "Spring 18",
    "Rating (out of 10)": 7,
    "Comments": "The profs are pretty good and pretty fun but the material is hard lol. But at least going to class isn't bad bc they're entertaining"
  },
  {
    "Core Member (Name)": "Dani",
    "Course": "MCELLBI 140",
    "Instructor": "Unal/Rine/Roelink",
    "Semester": "Sprin 18",
    "Rating (out of 10)": 8,
    "Comments": "I LOVE UNAL AND SHE'S PROB MY FAVE/THE BEST PROF I'VE EVER HAD AT BERKELEY. The profs are really really good at teaching/you can tell they love it, which makes learning the material so easy bc you'll understand it just by going to lecture tbh"
  },
  {
    "Core Member (Name)": "Dani",
    "Course": "MCELLBI 55",
    "Instructor": "Beatty, Vance",
    "Semester": "Fall 16",
    "Rating (out of 10)": 9,
    "Comments": "One of my fave classes!!! Both instructors were fun and it was such an interesting class. The class/exams were prob like 80% memorization tho"
  },
  {
    "Core Member (Name)": "Dani",
    "Course": "MCELLBI C100A/CHEM 130",
    "Instructor": "Kuriyan, Savage",
    "Semester": "Fall 17",
    "Rating (out of 10)": 10,
    "Comments": "I love this class!!! First 1/3 is a lot of memorization. Next 2/3 are mostly math. Material is cool though, psets aren't that hard, and midterms are really similar to past midterms/the psets (prob bc it's been the same two profs who taught it). Kuriyan is really organized"
  },
  {
    "Core Member (Name)": "Rafael",
    "Course": "MLAB Decal",
    "Instructor": "",
    "Semester": "Spring 18",
    "Rating (out of 10)": "",
    "Comments": ""
  },
  {
    "Core Member (Name)": "AJ",
    "Course": "MUSIC 128B",
    "Instructor": "Nicholas Mathew",
    "Semester": "Spring 18",
    "Rating (out of 10)": 6,
    "Comments": "Okay class, but I'm still not sure what this professor wanted in an essay cuz he kept talking about how he doesn't want a thesis or an introductory paragraph or transitions and stuff like that. Yeah, he was kinda weird, and the subject was ehhh"
  },
  {
    "Core Member (Name)": "AJ",
    "Course": "MUSIC 20A",
    "Instructor": "Jason Cress",
    "Semester": "Fall 17",
    "Rating (out of 10)": 8,
    "Comments": "If you took band or whatever, this class should be hella easy for you. Only thing was sight-singing which was ehh. This particular GSI was also chill, he was just kinda not a good teacher."
  },
  {
    "Core Member (Name)": "Rafael",
    "Course": "MUSIC 20A",
    "Instructor": "",
    "Semester": "",
    "Rating (out of 10)": "",
    "Comments": ""
  },
  {
    "Core Member (Name)": "AJ",
    "Course": "MUSIC 20B",
    "Instructor": "James Apgar",
    "Semester": "Spring 18",
    "Rating (out of 10)": 7,
    "Comments": "Again, if you took band, this class is chill, but sight-singing sux. Also, this particular GSI focused a lot on sight-singing so even if he was a better teacher than my 20A GSI, he made us sing too much ughhh"
  },
  {
    "Core Member (Name)": "Seth",
    "Course": "Music 26AC",
    "Instructor": "Tamara Roberts",
    "Semester": "Spring 17",
    "Rating (out of 10)": 10,
    "Comments": "Fun class and interesting class. Learn history of Music in America. One discussion per week. 2 papers, but fun papers.  Discussion take random attendance so you need to go."
  },
  {
    "Core Member (Name)": "AJ",
    "Course": "MUSIC 27",
    "Instructor": "Mary Ann Smart",
    "Semester": "Spring 18",
    "Rating (out of 10)": 7,
    "Comments": "Class is chill, like if you were in band, should be a breeze. Professor was... interesting. Like she apparently she graduated with a BA in Flute Performance, but like she doesn't speak like a musician."
  },
  {
    "Core Member (Name)": "Isabella",
    "Course": "MUSIC 27",
    "Instructor": "Mary Ann Smart",
    "Semester": "Spring 18",
    "Rating (out of 10)": 7,
    "Comments": "This class is really chill. I think the discussion section was pretty fun. It's also a great course to take for fun if you're into classical music/classical composers but might be really boring if you don't really care"
  },
  {
    "Core Member (Name)": "Sheena",
    "Course": "NUSCTX 10",
    "Instructor": "Marc Hellerstein",
    "Semester": "Fall 16",
    "Rating (out of 10)": 7,
    "Comments": "Easy HWs and very low time commitment. All you need to do is memorize. So if you're good at memorization or at bio/nutri sci, I recommend this class."
  },
  {
    "Core Member (Name)": "Seth",
    "Course": "Nutri Sci 10",
    "Instructor": "Mark Hellerstein & Robert Ryan",
    "Semester": "Fall 2016",
    "Rating (out of 10)": 6,
    "Comments": "Easy hwk. Interesting class. 3 midterms, but take the 2 highest. So if you do well on the first two you dont need to worry about the 3rd one. A lot of memorization.  You gotta attend discussion cuz they teach new materials there and they collect the hwk during that time"
  },
  {
    "Core Member (Name)": "Mikee",
    "Course": "NUTRISCI 10",
    "Instructor": "Greg Aponte",
    "Semester": "Spring 18",
    "Rating (out of 10)": 8,
    "Comments": "omg too much memorization but i #madeit lowkey missed every lecture but the slides cover everything"
  },
  {
    "Core Member (Name)": "Dani",
    "Course": "PB HLTH 162A",
    "Instructor": "Elbeik",
    "Semester": "Summer 17",
    "Rating (out of 10)": 8,
    "Comments": "This class was fun! (if you like microbio lol). It was a lot of info I guess, so memorization. The instructor is super cool though"
  },
  {
    "Core Member (Name)": "Mikee",
    "Course": "PHIL 2",
    "Instructor": "Sluga",
    "Semester": "Fall 18",
    "Rating (out of 10)": 8,
    "Comments": "missed half of the lectures yikes but it's ok :,); midterms are 2 essays/20 min. each, just read the readings or look at slides and you'll be fine"
  },
  {
    "Core Member (Name)": "Dani",
    "Course": "PHILOS 25A",
    "Instructor": "Clarke",
    "Semester": "Fall 16",
    "Rating (out of 10)": 7,
    "Comments": "I hate philosophy LOL. I wrote all the papers like the night or 2 nights before they were due and never really did the readings. I p/np'd the class but I think I would have ended up with a B"
  },
  {
    "Core Member (Name)": "Sheena",
    "Course": "Philos 3",
    "Instructor": "John Campbell",
    "Semester": "Spring 19",
    "Rating (out of 10)": 8,
    "Comments": "The concepts are very abstract and kinda confusing to follow the different theories. No midterms but there are ~5 page long essays. Pretty good lecturer with a strong Scottish accent, but the slides are not self-explanatory so you have to listen well."
  },
  {
    "Core Member (Name)": "Kathryn",
    "Course": "PHILOS W12A",
    "Instructor": "Wesley Holliday",
    "Semester": "Summer 18",
    "Rating (out of 10)": 7,
    "Comments": "I took this as an online class, but I think I would have liked it better if it was in-person. Problem sets were due every week along with a discussion post, but in order for you to get credit for the discussion part, you had to post and respond to 2 people's posts."
  },
  {
    "Core Member (Name)": "Dani",
    "Course": "PHYSICS 7A",
    "Instructor": "Yildiz",
    "Semester": "Spring 16",
    "Rating (out of 10)": 8,
    "Comments": "I hate physics but Yildiz is a great teacher!!!! His exams were kinda hard sometimes, but he took a lot of old exam questions (from Spelio exams so study those)."
  },
  {
    "Core Member (Name)": "Patty",
    "Course": "PHYSICS 7A",
    "Instructor": "Matthias Reinsch",
    "Semester": "Spring 2017",
    "Rating (out of 10)": 7,
    "Comments": "dont remember much of this class either, but it's basically high school physics (mechanics and gravity and something else i think). i do remember that Reinsch was really good at recreating diagrams on the blackboard. had lecture quizzes - used an iClicker and scored anything above a fifty percent as full credit. i can't remember how the exams were - i block physics exams out for my own sanity."
  },
  {
    "Core Member (Name)": "Dani",
    "Course": "PHYSICS 7B",
    "Instructor": "Bloxham",
    "Semester": "Summer 16",
    "Rating (out of 10)": 6,
    "Comments": "I still hate physics. Bloxham was a cool person, but his teaching was meh."
  },
  {
    "Core Member (Name)": "Patty",
    "Course": "PHYSICS 7B",
    "Instructor": "Nathan Lowhorn",
    "Semester": "Summer 2018",
    "Rating (out of 10)": 7,
    "Comments": "for context: i failed physics 7B with robert birgeneau. he was an old guy who liked to go off on tangents about successful people he knew in the field. it didn't work for me. but lowhorn had literally just gotten to berkeley when he taught the summer session, but he still managed to make the content accessible. uses slides - posts the blank ones before lecture so you can print them out and fill them out as he does the same in class if you want. will also post those written-on slides after lecture. it was great, especially for his first class ever and how fast it was going. has a dry sense of humor and is lowkey relatable."
  },
  {
    "Core Member (Name)": "Patty",
    "Course": "PHYSICS 7C",
    "Instructor": "Matt Pyle",
    "Semester": "Fall 2018",
    "Rating (out of 10)": 6,
    "Comments": "still happening, but kinda disorganized. might be because he and his wife just had a baby. a lot of the lecture is complicated derivations, and then he'll say we don't need to know it. first exam was a surprising format and everyone had their complaints in section, how it didn't really test knowledge of the physics but rather the trigonometry and such."
  },
  {
    "Core Member (Name)": "Sheena",
    "Course": "PSYCH 110",
    "Instructor": "Joni Wallis",
    "Semester": "Fall 18",
    "Rating (out of 10)": 7,
    "Comments": "So far, this class is basically a review of Cog sci 1 with a little bit more detail. Joni has good pacing and has an interesting accent, but can be kinda monotone at times."
  },
  {
    "Core Member (Name)": "Sheena",
    "Course": "Psych 160",
    "Instructor": "Iris Mauss",
    "Semester": "Spring 19",
    "Rating (out of 10)": 6,
    "Comments": "Ok class, easy to follow along with the concepts because social psychology is pretty straightforward. Only downside are the readings (they're super long). Weekly responses are a thing too."
  },
  {
    "Core Member (Name)": "AJ",
    "Course": "PSYCH N117",
    "Instructor": "Jesse Bengson",
    "Semester": "Summer 18",
    "Rating (out of 10)": 5,
    "Comments": "He's not a Berkeley professor (like he teaches in Davis I think), and it shows. I'm not trying to be elitist or anything, but like he would say stuff like \"Gravity is only a theory\" and \"There was a study done on driverless cars that they hit men at a larger rate than women. This is why we don't need feminism.\" Like he was obviously trying to be funny and sarcastic for that last joke, but yeah he set it up awkwardly and it kinda crashed and burned. He was also gonna give me a lower grade because he didn't know how to change my grade after grades were due since he gave me the wrong grade in the first place. Otherwise, class was aight ig, just take it in the Fall or Spring."
  },
  {
    "Core Member (Name)": "Dani",
    "Course": "PSYCH W1",
    "Instructor": "Gade",
    "Semester": "Spring 17",
    "Rating (out of 10)": 9,
    "Comments": "It's pretty easy, just don't fall behind lol. Online"
  },
  {
    "Core Member (Name)": "Kathryn",
    "Course": "PSYCH W1",
    "Instructor": "Christopher Gade",
    "Semester": "Fall 17",
    "Rating (out of 10)": 7,
    "Comments": "Online class. The ZAPS which were online interactive lessons were really fun. The was really not bad. I took it to cover the social and behavioral breadth."
  },
  {
    "Core Member (Name)": "Seth",
    "Course": "Psych W1",
    "Instructor": "Christopher Gade",
    "Semester": "Spring 18",
    "Rating (out of 10)": 5,
    "Comments": "Its an online class so its pretty easy to be behind schedule. 2 midterms are online. Midterm 3 and Final are in person during finals week. Thought it would be an easy class cuz past the midterm on past semesters were all online but they changed it up on me on my semester. But easy class to PNP though."
  },
  {
    "Core Member (Name)": "Sheena",
    "Course": "Psych/CogSci C126",
    "Instructor": "David Whitney",
    "Semester": "Spring 19",
    "Rating (out of 10)": 9,
    "Comments": "The class is about visual perception so it's very interesting (You get to learn about how optical illusions work!). Professor goes quickly during lecture but the lecture is reiterated during discussion so it's easier to follow. Also gives research opportunities"
  },
  {
    "Core Member (Name)": "Kendal",
    "Course": "Ruby on Rails DeCal",
    "Instructor": "",
    "Semester": "Spring 18",
    "Rating (out of 10)": "",
    "Comments": ""
  },
  {
    "Core Member (Name)": "Jo",
    "Course": "S, SEASN 160",
    "Instructor": "Joi Barrios",
    "Semester": "Summer 2018",
    "Rating (out of 10)": 7,
    "Comments": "Easy A, good history breadth. Only offered in the summer"
  },
  {
    "Core Member (Name)": "Kathryn",
    "Course": "SCANDIN 106",
    "Instructor": "Jenna Coughlin",
    "Semester": "Spring 18",
    "Rating (out of 10)": 10,
    "Comments": "Really easy class. If you like fairy tales and Hans Christian Andersen stories, you will really like this class. It was the first time Prof. Coughlin was teaching the class, but it was really great. The class was based on attendance, 2 discussion posts, a midterm, a paper, and a final. The final and the midterm were in very similar formats and she gave a study guide beforehand. They both consisted of defining terms, analyzing passages, and a short essay. Very enjoyable class"
  },
  {
    "Core Member (Name)": "Mikee",
    "Course": "SEAS 10B",
    "Instructor": "Siapno",
    "Semester": "Spring 17",
    "Rating (out of 10)": "tbh idk",
    "Comments": "idk how to feel about this class, the professor died a week before school started so they flew in this filipino alumni and she was a cray teacher who just talked about her dead husband, child, and whatnot. idk if this is still a class; plz do not take it if she's the teacher"
  },
  {
    "Core Member (Name)": "Mikee",
    "Course": "STAT 133",
    "Instructor": "Gaston Sanchez",
    "Semester": "Spring 18",
    "Rating (out of 10)": 8,
    "Comments": "not a bad class at all, very similar to da 8 in terms of coding tabular data; just ask gsi if you need help, it's a v chill class"
  },
  {
    "Core Member (Name)": "Kathryn",
    "Course": "STAT 140",
    "Instructor": "Ani Adhikari",
    "Semester": "Fall 18",
    "Rating (out of 10)": 6,
    "Comments": "This class required a lot of work from me and it was difficult. You definitely have to put a lot of effort to do well in the class. Weekly hw, labs, a midterm, and quizzes every other week"
  },
  {
    "Core Member (Name)": "Kendal",
    "Course": "STAT 140",
    "Instructor": "",
    "Semester": "Spring 18",
    "Rating (out of 10)": "",
    "Comments": ""
  },
  {
    "Core Member (Name)": "Kendal",
    "Course": "STAT 20",
    "Instructor": "",
    "Semester": "",
    "Rating (out of 10)": "",
    "Comments": ""
  },
  {
    "Core Member (Name)": "Patty",
    "Course": "STAT 20",
    "Instructor": "Shobhana Stoyanov",
    "Semester": "Fall 2016",
    "Rating (out of 10)": 7,
    "Comments": "twas okay. can't remember much of it, only that my GSI was absolutely fantastic and hella good at teaching the concepts. i loved him. Jordan P-something."
  },
  {
    "Core Member (Name)": "Kathryn",
    "Course": "STAT C100",
    "Instructor": "Josh Hug, Fernando Perez",
    "Semester": "Fall 18",
    "Rating (out of 10)": 8,
    "Comments": "This was a pretty good class with fun projects and hw, but damn were those tests difficult lmao (thx hug)"
  },
  {
    "Core Member (Name)": "Kathryn",
    "Course": "STAT C8",
    "Instructor": "Ani Adhikari",
    "Semester": "Spring 18",
    "Rating (out of 10)": 10,
    "Comments": "My favorite class so far. The lectures were great and Adhikari is a great lecturer. The content of the class is really interesting and the projects were actually pretty fun."
  },
  {
    "Core Member (Name)": "Mikee",
    "Course": "STATS 134",
    "Instructor": "Hank Ibser",
    "Semester": "Fall 17",
    "Rating (out of 10)": 7,
    "Comments": "wasn't the best lecturer but omg mike the adjunct professor is da best; he does office hours every day every night i cry :' i really like computational math and stats so if you're interested in either, plz take the class! lezgo stats/data science majors!"
  },
  {
    "Core Member (Name)": "Dani",
    "Course": "THEATER 118AC",
    "Instructor": "De Kosnik",
    "Semester": "Summer 16",
    "Rating (out of 10)": 10,
    "Comments": "SUPER EASY AC that also covers arts and lit breadth. Was online. You had to take tv shows/pop culture in as your examples so the more tv you watch, the better ;)"
  },
  {
    "Core Member (Name)": "Patty",
    "Course": "THEATER 52AC",
    "Instructor": "SanSan Kwan",
    "Semester": "Fall 2016",
    "Rating (out of 10)": 8,
    "Comments": "a fun class to take for an AC + a breadth (arts, i think). no exams, only papers - you have to write like 5 out of 6 i think? you didnt have to do one is what i remember. also gets you tickets into cool performances since you have to write a review about one of 'em. we had a class on Beyonce's Lemonade once."
  },
  {
    "Core Member (Name)": "Kendal",
    "Course": "UGBA 10",
    "Instructor": "",
    "Semester": "",
    "Rating (out of 10)": "",
    "Comments": ""
  },
  {
    "Core Member (Name)": "Isabella",
    "Course": "UGBA 96",
    "Instructor": "",
    "Semester": "Fall 17",
    "Rating (out of 10)": 7,
    "Comments": "Really cool class - it has around 20 people and 5 Haas professors that basically teach you how to incorporate creativity and leadership into business administration. Lots of group project work and really fun! Mostly Pre-Haas students take this but I think it's great for anyone. You also get to know the Haas professors pretty well - I was able to get connected to startup work through them."
  },
  {
    "Core Member (Name)": "Patty",
    "Course": "UGIS 187",
    "Instructor": "Mark Spencer",
    "Semester": "Fall 2018",
    "Rating (out of 10)": 8,
    "Comments": "still happening, but it's an intensive CalTeach course and requires a 4-hour field placement each week at a high school or middle school. can be hella far - mine's in Balboa Park in SF. HELLA HELLA HELLA group work. you got multiple group projects going on at once. the GSI though will help you stay organized. will have you bring snacks one week because it's three hours long. i like it so far."
  },
  {
    "Core Member (Name)": "Patty",
    "Course": "UGIS 82",
    "Instructor": "Emily Weiss & Sarah Pedemonte",
    "Semester": "Spring 2017",
    "Rating (out of 10)": 8,
    "Comments": "highkey not something you take just to take because it requires a field placement - you head out into an elementary school for an hour each week, observing and eventually teaching a little bit of a lesson. would only recommend if you're thinking of teaching. it's the gateway course into the CalTeach minor."
  },
  {
    "Core Member (Name)": "Kendal",
    "Course": "Web Design DeCal",
    "Instructor": "",
    "Semester": "Fall 17",
    "Rating (out of 10)": "",
    "Comments": ""
  },
  {
    "Core Member (Name)": "Sheena",
    "Course": "Web Design DeCal",
    "Instructor": "Jemma Kwak",
    "Semester": "Fall 18",
    "Rating (out of 10)": 8,
    "Comments": "Lectures tend to be pretty boring, but the things you learn are neat and applicable. If u want to make websites, this decal is good not just for coding but also UI/UX design. By the end of the decal, you would have redesigned an existing website, and also made your own from scratch."
  }
]